In [24]:
import pandas as pd
import numpy as np
review = pd.read_csv('final_reviews_dataset.csv')
review.head()

                           order_id latest_comment_time  max_score
0  00010242fe8c5a6d1ba2dd792cb16214    22/09/2017 10:57          5
1  00018f77f2f0320c557190d7a144bdd3    15/05/2017 11:34          4
2  000229ec398224ef6ca0657da4fc703e    23/01/2018 16:06          5
3  00024acbcdf0a6daa1e931b038114c75    15/08/2018 16:39          4
4  00042b26cf59d7ce69dfabb4e55b4fd9    03/03/2017 10:54          5

In [25]:
review.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 89552 entries, 0 to 89551
Data columns (total 3 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   order_id             89552 non-null  object
 1   latest_comment_time  89552 non-null  object
 2   max_score            89552 non-null  int64
dtypes: int64(1), object(2)
memory usage: 2.0+ MB

In [27]:
review['latest_comment_time'] = pd.to_datetime(review['latest_comment_time'])

In [29]:
review.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 89552 entries, 0 to 89551
Data columns (total 3 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   order_id             89552 non-null  object
 1   latest_comment_time  89552 non-null  datetime64[ns]
 2   max_score            89552 non-null  int64
dtypes: datetime64[ns](1), int64(1), object(1)
memory usage: 2.0+ MB

In [30]:
review['Year'] =  pd.DatetimeIndex(review['latest_comment_time']).year

In [31]:
review.head()

                           order_id latest_comment_time  max_score  Year
0  00010242fe8c5a6d1ba2dd792cb16214 2017-09-22 10:57:00          5  2017
1  00018f77f2f0320c557190d7a144bdd3 2017-05-15 11:34:00          4  2017
2  000229ec398224ef6ca0657da4fc703e 2018-01-23 16:06:00          5  2018
3  00024acbcdf0a6daa1e931b038114c75 2018-08-15 16:39:00          4  2018
4  00042b26cf59d7ce69dfabb4e55b4fd9 2017-03-03 10:54:00          5  2017

In [8]:
review.groupby('Year').mean()

      review_score
Year
2016      3.503597
2017      4.101204
2018      4.054963

In [32]:
review['Month']=pd.DatetimeIndex(review['latest_comment_time']).month

In [33]:
review.head()

,order_id,latest_comment_time,max_score,Year,Month
0,00010242fe8c5a6d1ba2dd792cb16214,2017-09-22 10:57:00,5,2017,9
1,00018f77f2f0320c557190d7a144bdd3,2017-05-15 11:34:00,4,2017,5
2,000229ec398224ef6ca0657da4fc703e,2018-01-23 16:06:00,5,2018,1
3,00024acbcdf0a6daa1e931b038114c75,2018-08-15 16:39:00,4,2018,8
4,00042b26cf59d7ce69dfabb4e55b4fd9,2017-03-03 10:54:00,5,2017,3

In [13]:
review.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 89583 entries, 0 to 89582
Data columns (total 6 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   order_id                 89583 non-null  object
 1   review_answer_timestamp  89583 non-null  datetime64[ns]
 2   review_id                89583 non-null  object
 3   review_score             89583 non-null  int64
 4   Year                     89583 non-null  int64
 5   Month                    89583 non-null  int64
dtypes: datetime64[ns](1), int64(3), object(2)
memory usage: 4.1+ MB

In [34]:
grouped_data = review.groupby(['Year','Month']).mean()

In [52]:
grouped_data
month_avg_rate = grouped_data
month_avg_rate.to_csv('month_avg_rate.csv')

In [36]:
ratingdata = review.groupby(['Year']).count()

In [37]:
ratingdata

      order_id  latest_comment_time  max_score  Month
Year
2016       278                  278        278    278
2017     37922                37922      37922  37922
2018     51352                51352      51352  51352

In [39]:
newdata = review[review['Year'] != 2016]

In [40]:
newdata.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 89274 entries, 0 to 89551
Data columns (total 5 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   order_id             89274 non-null  object
 1   latest_comment_time  89274 non-null  datetime64[ns]
 2   max_score            89274 non-null  int64
 3   Year                 89274 non-null  int64
 4   Month                89274 non-null  int64
dtypes: datetime64[ns](1), int64(3), object(1)
memory usage: 4.1+ MB

In [41]:
newdata.groupby(['Year']).count()

      order_id  latest_comment_time  max_score  Month
Year
2017     37922                37922      37922  37922
2018     51352                51352      51352  51352

In [45]:
newdata = newdata.sort_values(by=['latest_comment_time'])

In [46]:
newdata.head()

,order_id,latest_comment_time,max_score,Year,Month
71710,cd068e0974cffc5007e3b5dcb416da26,2017-01-02 00:27:00,5,2017,1
78231,df537c849af44beef86a7ef7de12126a,2017-01-02 01:04:00,1,2017,1
70138,c870ef6a8e1d8eec841d79b42a6a20e4,2017-01-02 02:08:00,3,2017,1
5193,0eaa4845a6182d6b72de720fb976abd4,2017-01-02 02:17:00,4,2017,1
3777,0aaf52291c13507e7fe4f565f079ad9a,2017-01-02 08:47:00,5,2017,1

In [50]:
newdata = newdata.reset_index(drop=True)

In [51]:
newdata

,order_id,latest_comment_time,max_score,Year,Month
0,cd068e0974cffc5007e3b5dcb416da26,2017-01-02 00:27:00,5,2017,1
1,df537c849af44beef86a7ef7de12126a,2017-01-02 01:04:00,1,2017,1
2,c870ef6a8e1d8eec841d79b42a6a20e4,2017-01-02 02:08:00,3,2017,1
3,0eaa4845a6182d6b72de720fb976abd4,2017-01-02 02:17:00,4,2017,1
4,0aaf52291c13507e7fe4f565f079ad9a,2017-01-02 08:47:00,5,2017,1
...,...,...,...,...,...
89269,3cd1fc00785c7052ace31b764290e42c,2018-12-09 08:22:00,5,2018,12
89270,cd81b7b31890c8ba170157abdfcd941f,2018-12-09 12:50:00,5,2018,12
89271,a2bcbea8668a0d93334cf7f7fafe921d,2018-12-09 16:44:00,4,2018,12
89272,6eace5a496456d346454761a9fc00dd2,2018-12-09 20:33:00,4,2018,12
89273,8a0fb3426be7ed94d14c6b72cb5b5774,2018-12-10 03:16:00,5,2018,12

In [54]:
newdata.loc[71419,:] #split test and train

order_id               8c7a5e0c8c232e87d70485ec3ce91549
latest_comment_time                 2018-07-04 05:45:00
max_score                                             5
Year                                               2018
Month                                                 7
Name: 71419, dtype: object